test/mocks/stripe.json

{

  "accounts": {

    "create": {
      "id": "stripeid",
      "email": "philippe.modard+customer@gmail.com",
      "keys": {
          "secret": "stripesecret",
          "publishable": "stripepublishable"
      }
    }

  },

  "customers": {

    "create": {
      "object": "customer",
      "created": 1432412123,
      "id": "cus_6IJf9vLMFVsKzX",
      "livemode": false,
      "description": "Customer for test@example.com",
      "email": "philippe.modard+customer@gmail.com",
      "delinquent": false,
      "metadata": {
        "accountId": "stripeid"
      },
      "subscriptions": {},
      "discount": null,
      "account_balance": 0,
      "currency": null,
      "sources": {},
      "default_source": "card_165j1jIqnMN1wWwOzm6Cjmea"
    }

  },

  "charges": {

    "create": {
      "id": "ch_165j8nIqnMN1wWwOw9BcxMMR",
      "object": "charge",
      "created": 1432412561,
      "livemode": false,
      "paid": true,
      "status": "succeeded",
      "amount": 1230,
      "currency": "usd",
      "refunded": false,
      "source": {
        "id": "card_165j1jIqnMN1wWwOzm6Cjmea",
        "object": "card",
        "last4": "4242",
        "brand": "Visa",
        "funding": "credit",
        "exp_month": 8,
        "exp_year": 2016,
        "fingerprint": "QgShyKJhtqpJa9D7",
        "country": "US",
        "customer": "cus_6IJf9vLMFVsKzX"
      },
      "captured": true,
      "balance_transaction": "txn_165j8oIqnMN1wWwOKlPn1D4y",
      "customer": "cus_6IJf9vLMFVsKzX",
      "metadata": {}
    }

  },

  "plans": {
    "create": {
      "id": "test",
      "object": "plan",
      "amount": 1233,
      "created": 1450088389,
      "currency": "usd",
      "interval": "month",
      "interval_count": 1,
      "livemode": false,
      "metadata": {
      },
      "name": "test",
      "statement_descriptor": null,
      "trial_period_days": null
    },

    "create_not_found": {
      "type": "invalid_request_error",
      "message": "No such plan: month-5000",
      "param": "id",
      "requestId": "req_7Y8TeQytYKcs1k"
    }
  },

  "subscriptions": {
    "create": {
      "id": "sub_7Y8hSfCDvJ4TnD",
      "object": "subscription",
      "application_fee_percent": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "current_period_end": 1453039696,
      "current_period_start": 1450361296,
      "customer": "cus_7Y8htG0P2iod3U",
      "discount": null,
      "ended_at": null,
      "metadata": {
      },
      "plan": {
        "id": "gold21323",
        "object": "plan",
        "amount": 2000,
        "created": 1386247539,
        "currency": "usd",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
        },
        "name": "New plan name",
        "statement_descriptor": null,
        "trial_period_days": null
      },
      "quantity": 1,
      "start": 1450361296,
      "status": "active",
      "tax_percent": null,
      "trial_end": null,
      "trial_start": null
    }
  }

}
